from src.utils import get_to, get_from, get_date
import pytest


@pytest.mark.parametrize('a, b', [('Счет 90424923579946435907', 'Счет **5907'),
                                  ('Счет 35158586384610753655', 'Счет **3655'),
                                  ('Счет 43241152692663622869', 'Счет **2869'),
                                  ('Счет 46765464282437878125', 'Счет **8125'),
                                  ('Счет 77613226829885488381', 'Счет **8381')])
def test_get_to(a, b):
    assert get_to(a) == b


@pytest.mark.parametrize('a, b', [(None, ''),
                                  ('Visa Classic 2842878893689012', 'Visa Classic 2842 87** ****9012 -> '),
                                  ('Maestro 7810846596785568', 'Maestro 7810 84** ****5568 -> '),
                                  ('Счет 38611439522855669794', 'Счет **9794 -> ')])
def test_get_from(a, b):
    assert get_from(a) == b


@pytest.mark.parametrize('a, b', [('2019-12-08T22:46:21.935582', '08.12.2019'),
                                  ('2019-12-07T06:17:14.634890', '07.12.2019'),
                                  ('2019-11-19T09:22:25.899614', '19.11.2019'),
                                  ('2019-11-13T17:38:04.800051', '13.11.2019'),
                                  ('2019-11-05T12:04:13.781725', '05.11.2019')])
def test_get_date(a, b):
    assert get_date(a) == b
